1c-extension/src/Catalogs/трепр_МобильныеУстройства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>трепр_МобильныеУстройства</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУстройства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>d5p1:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>d5p1:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1c-extension/src/HTTPServices/трепр_МобильноеПриложение/Ext/Module.bsl
// HTTP-сервис "трепр_МобильноеПриложение"
// REST API мобильного приложения торгпреда (TradeRep). Контракт совместим с
// фронтендом: GET /products|categories|customers, GET/POST /orders,
// PUT/DELETE /orders/{num}, POST /auth.
//
// Все данные фильтруются по МОБИЛЬНОМУ УСТРОЙСТВУ
// (Справочник.трепр_МобильныеУстройства). Идентификатор устройства передаётся
// в заголовке "X-Device-Id" или в параметре запроса ?device=<GUID>.
// Устройство задаёт: склад (остатки), тип цен, менеджера, список контрагентов и товаров.
//
// ВНИМАНИЕ: создание ЗаказаПокупателя использует реквизиты, специфичные для
// "Управление торговлей для Украины". Поля, помеченные // TODO, нужно выверить
// на боевой базе (организация по умолчанию, договор взаиморасчётов, валюта).

#Область ОбработчикиМетодов

// POST /auth — { deviceId } -> валидация устройства, возврат пользователя/токена.
Функция AuthPost(Запрос) Экспорт
	Тело = ПрочитатьТелоJSON(Запрос);
	ИдУстройства = "";
	Если ТипЗнч(Тело) = Тип("Соответствие") И Тело.Получить("deviceId") <> Неопределено Тогда
		ИдУстройства = СокрЛП(Строка(Тело.Получить("deviceId")));
	КонецЕсли;
	Если ПустаяСтрока(ИдУстройства) Тогда
		ИдУстройства = ИдентификаторУстройстваИзЗапроса(Запрос);
	КонецЕсли;

	Устройство = НайтиУстройство(ИдУстройства);
	Если Устройство = Неопределено Тогда
		Возврат ОтветJSON(Новый Структура("success, message", Ложь, "Устройство не зарегистрировано"), 401);
	КонецЕсли;

	Пользователь = Новый Структура("name, role", Строка(Устройство.Менеджер), "sales_rep");
	Возврат ОтветJSON(Новый Структура("success, user, token", Истина, Пользователь, ИдУстройства));
КонецФункции

// GET /products — номенклатура устройства с ценой (по типу цен) и остатком (по складу).
Функция ProductsGet(Запрос) Экспорт
	Устройство = ОпределитьУстройство(Запрос);
	Если Устройство = Неопределено Тогда Возврат ОтветНеАвторизован(); КонецЕсли;
	Возврат ОтветJSON(ТоварыУстройства(Устройство));
КонецФункции

// GET /categories — группы номенклатуры устройства.
Функция CategoriesGet(Запрос) Экспорт
	Устройство = ОпределитьУстройство(Запрос);
	Если Устройство = Неопределено Тогда Возврат ОтветНеАвторизован(); КонецЕсли;
	Возврат ОтветJSON(КатегорииУстройства(Устройство));
КонецФункции

// GET /customers — контрагенты устройства с текущим долгом.
Функция CustomersGet(Запрос) Экспорт
	Устройство = ОпределитьУстройство(Запрос);
	Если Устройство = Неопределено Тогда Возврат ОтветНеАвторизован(); КонецЕсли;
	Возврат ОтветJSON(КонтрагентыУстройства(Устройство));
КонецФункции

// GET /orders?startDate=&endDate= — заказы менеджера устройства за период.
Функция OrdersGet(Запрос) Экспорт
	Устройство = ОпределитьУстройство(Запрос);
	Если Устройство = Неопределено Тогда Возврат ОтветНеАвторизован(); КонецЕсли;

	Параметры = Запрос.ПараметрыЗапроса;
	НачалоПериода = ?(Параметры.Получить("startDate") = Неопределено, "", Параметры.Получить("startDate"));
	КонецПериода   = ?(Параметры.Получить("endDate")   = Неопределено, "", Параметры.Получить("endDate"));

	Возврат ОтветJSON(ЗаказыУстройства(Устройство, НачалоПериода, КонецПериода));
КонецФункции

// POST /orders — создать ЗаказПокупателя.
Функция OrdersPost(Запрос) Экспорт
	Устройство = ОпределитьУстройство(Запрос);
	Если Устройство = Неопределено Тогда Возврат ОтветНеАвторизован(); КонецЕсли;

	Тело = ПрочитатьТелоJSON(Запрос);
	Если ТипЗнч(Тело) <> Тип("Соответствие") Тогда
		Возврат ОтветJSON(Новый Структура("success, message", Ложь, "Некорректное тело запроса"), 400);
	КонецЕсли;

	Попытка
		СсылкаЗаказа = СоздатьЗаказ(Устройство, Тело);
	Исключение
		Возврат ОтветJSON(Новый Структура("success, message", Ложь, ОписаниеОшибки()), 400);
	КонецПопытки;

	Возврат ОтветJSON(Новый Структура("success, order", Истина, ГидратироватьЗаказ(СсылкаЗаказа)));
КонецФункции

// PUT /orders/{num} — обновить состав/статус заказа.
Функция OrderPut(Запрос) Экспорт
	Устройство = ОпределитьУстройство(Запрос);
	Если Устройство = Неопределено Тогда Возврат ОтветНеАвторизован(); КонецЕсли;

	СсылкаЗаказа = НайтиЗаказПоНомеру(Запрос.ПараметрыURL.Получить("num"));
	Если СсылкаЗаказа = Неопределено Тогда
		Возврат ОтветJSON(Новый Структура("success, message", Ложь, "Заказ не найден"), 404);
	КонецЕсли;

	Тело = ПрочитатьТелоJSON(Запрос);
	Попытка
		ОбновитьЗаказ(СсылкаЗаказа, Устройство, Тело);
	Исключение
		Возврат ОтветJSON(Новый Структура("success, message", Ложь, ОписаниеОшибки()), 400);
	КонецПопытки;

	Возврат ОтветJSON(Новый Структура("success, order", Истина, ГидратироватьЗаказ(СсылкаЗаказа)));
КонецФункции

// DELETE /orders/{num} — удалить заказ.
Функция OrderDelete(Запрос) Экспорт
	Устройство = ОпределитьУстройство(Запрос);
	Если Устройство = Неопределено Тогда Возврат ОтветНеАвторизован(); КонецЕсли;

	СсылкаЗаказа = НайтиЗаказПоНомеру(Запрос.ПараметрыURL.Получить("num"));
	Если СсылкаЗаказа = Неопределено Тогда
		Возврат ОтветJSON(Новый Структура("success, message", Ложь, "Заказ не найден"), 404);
	КонецЕсли;

	ОбъектЗаказа = СсылкаЗаказа.ПолучитьОбъект();
	ОбъектЗаказа.Удалить();

	Возврат ОтветJSON(Новый Структура("success, message", Истина, "Заказ удалён"));
КонецФункции

#КонецОбласти

#Область Устройство

Функция ИдентификаторУстройстваИзЗапроса(Запрос)
	Идентификатор = Запрос.Заголовки.Получить("X-Device-Id");
	Если ПустаяСтрока(Идентификатор) Тогда
		Идентификатор = Запрос.ПараметрыЗапроса.Получить("device");
	КонецЕсли;
	Возврат ?(Идентификатор = Неопределено, "", СокрЛП(Идентификатор));
КонецФункции

Функция НайтиУстройство(Идентификатор)
	Если ПустаяСтрока(Идентификатор) Тогда Возврат Неопределено; КонецЕсли;
	Отбор = Справочники.трепр_МобильныеУстройства.НайтиПоРеквизиту("ИдентификаторУстройства", Идентификатор);
	Возврат ?(ЗначениеЗаполнено(Отбор), Отбор, Неопределено);
КонецФункции

Функция ОпределитьУстройство(Запрос)
	Возврат НайтиУстройство(ИдентификаторУстройстваИзЗапроса(Запрос));
КонецФункции

#КонецОбласти

#Область Данные

Функция ТоварыУстройства(Устройство)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Устройство", Устройство);
	Запрос.УстановитьПараметр("Склад", Устройство.Склад);
	Запрос.УстановитьПараметр("ТипЦен", Устройство.ТипЦен);
	Запрос.Текст =
	"ВЫБРАТЬ Товары.Номенклатура КАК Номенклатура ПОМЕСТИТЬ ВТ_Товары
	|ИЗ Справочник.трепр_МобильныеУстройства.Товары КАК Товары
	|ГДЕ Товары.Ссылка = &Устройство
	|;
	|ВЫБРАТЬ
	|	ВТ.Номенклатура КАК Ссылка,
	|	ВТ.Номенклатура.Наименование КАК Наименование,
	|	ВТ.Номенклатура.Артикул КАК Артикул,
	|	ВТ.Номенклатура.БазоваяЕдиницаИзмерения.Наименование КАК Единица,
	|	ВТ.Номенклатура.Родитель.Наименование КАК Категория,
	|	ЕСТЬNULL(Цены.Цена, 0) КАК Цена,
	|	ЕСТЬNULL(Остатки.КоличествоОстаток, 0) - ЕСТЬNULL(Резерв.КоличествоОстаток, 0) КАК Остаток
	|ИЗ
	|	ВТ_Товары КАК ВТ
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ТипЦен = &ТипЦен) КАК Цены
	|		ПО Цены.Номенклатура = ВТ.Номенклатура
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК Остатки
	|		ПО Остатки.Номенклатура = ВТ.Номенклатура
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад = &Склад) КАК Резерв
	|		ПО Резерв.Номенклатура = ВТ.Номенклатура";

	Результат = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Товар = Новый Структура;
		Товар.Вставить("id", ИдСсылки(Выборка.Ссылка));
		Товар.Вставить("name", Выборка.Наименование);
		Товар.Вставить("sku", Выборка.Артикул);
		Товар.Вставить("price", Выборка.Цена);
		Товар.Вставить("stock", Выборка.Остаток);
		Товар.Вставить("unit", Выборка.Единица);
		Товар.Вставить("category", Выборка.Категория);
		Товар.Вставить("img", ""); // реальные фото — отдельная задача (#33)
		Результат.Добавить(Товар);
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция КатегорииУстройства(Устройство)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Устройство", Устройство);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.Номенклатура.Родитель КАК Группа,
	|	КОЛИЧЕСТВО(Товары.Номенклатура) КАК Кол
	|ИЗ Справочник.трепр_МобильныеУстройства.Товары КАК Товары
	|ГДЕ Товары.Ссылка = &Устройство И Товары.Номенклатура.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|СГРУППИРОВАТЬ ПО Товары.Номенклатура.Родитель";

	Результат = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Категория = Новый Структура;
		Категория.Вставить("id", ИдСсылки(Выборка.Группа));
		Категория.Вставить("name", Строка(Выборка.Группа));
		Категория.Вставить("icon", "");
		Категория.Вставить("count", Выборка.Кол);
		Категория.Вставить("expanded", Ложь);
		Результат.Добавить(Категория);
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция КонтрагентыУстройства(Устройство)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Устройство", Устройство);
	Запрос.Текст =
	"ВЫБРАТЬ Контрагенты.Контрагент КАК Контрагент ПОМЕСТИТЬ ВТ_Контр
	|ИЗ Справочник.трепр_МобильныеУстройства.Контрагенты КАК Контрагенты
	|ГДЕ Контрагенты.Ссылка = &Устройство
	|;
	|ВЫБРАТЬ
	|	ВТ.Контрагент КАК Ссылка,
	|	ВТ.Контрагент.Наименование КАК Наименование,
	|	ВТ.Контрагент.Код КАК Код,
	|	ВТ.Контрагент.ЮридическийАдрес КАК Город,
	|	ЕСТЬNULL(Долги.СуммаУпрОстаток, 0) КАК Долг
	|ИЗ
	|	ВТ_Контр КАК ВТ
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки КАК Долги
	|		ПО Долги.Контрагент = ВТ.Контрагент";

	Результат = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Контрагент = Новый Структура;
		Контрагент.Вставить("id", ИдСсылки(Выборка.Ссылка));
		Контрагент.Вставить("name", Выборка.Наименование);
		Контрагент.Вставить("code", Выборка.Код);
		Контрагент.Вставить("city", Строка(Выборка.Город));
		Контрагент.Вставить("contact", "");
		Контрагент.Вставить("phone", "");
		Контрагент.Вставить("debt", Выборка.Долг);
		Результат.Добавить(Контрагент);
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция ЗаказыУстройства(Устройство, НачалоПериода, КонецПериода)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Менеджер", Устройство.Менеджер);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДатыИзСтроки(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДатыИзСтроки(КонецПериода));
	Запрос.Текст =
	"ВЫБРАТЬ Заказ.Ссылка КАК Ссылка
	|ИЗ Документ.ЗаказПокупателя КАК Заказ
	|ГДЕ Заказ.Ответственный = &Менеджер
	|	И (&НачалоПериода = ДАТАВРЕМЯ(1,1,1) ИЛИ Заказ.Дата >= &НачалоПериода)
	|	И (&КонецПериода = ДАТАВРЕМЯ(1,1,1) ИЛИ Заказ.Дата <= &КонецПериода)
	|УПОРЯДОЧИТЬ ПО Заказ.Дата УБЫВ";

	Результат = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(ГидратироватьЗаказ(Выборка.Ссылка));
	КонецЦикла;
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область Заказы

Функция ГидратироватьЗаказ(СсылкаЗаказа)
	Заказ = СсылкаЗаказа.ПолучитьОбъект();

	Контрагент = Новый Структура;
	Контрагент.Вставить("id", ИдСсылки(Заказ.Контрагент));
	Контрагент.Вставить("name", Строка(Заказ.Контрагент));
	Контрагент.Вставить("code", Заказ.Контрагент.Код);
	Контрагент.Вставить("city", Строка(Заказ.Контрагент.ЮридическийАдрес));

	Позиции = Новый Массив;
	Сумма = 0;
	Для Каждого СтрокаТовара Из Заказ.Товары Цикл
		Товар = Новый Структура;
		Товар.Вставить("id", ИдСсылки(СтрокаТовара.Номенклатура));
		Товар.Вставить("name", Строка(СтрокаТовара.Номенклатура));
		Товар.Вставить("sku", СтрокаТовара.Номенклатура.Артикул);
		Товар.Вставить("price", СтрокаТовара.Цена);
		Товар.Вставить("unit", Строка(СтрокаТовара.ЕдиницаИзмерения));
		Товар.Вставить("img", "");

		Позиция = Новый Структура("product, qty", Товар, СтрокаТовара.Количество);
		Позиции.Добавить(Позиция);
		Сумма = Сумма + СтрокаТовара.Цена * СтрокаТовара.Количество;
	КонецЦикла;

	Статус = ?(Заказ.Проведен, "Відправлено", "Чернетка");

	Результат = Новый Структура;
	Результат.Вставить("num", Заказ.Номер);
	Результат.Вставить("customerId", ИдСсылки(Заказ.Контрагент));
	Результат.Вставить("client", Строка(Заказ.Контрагент));
	Результат.Вставить("customer", Контрагент);
	Результат.Вставить("date", Формат(Заказ.Дата, "ДФ=yyyy-MM-dd"));
	Результат.Вставить("status", Статус);
	Результат.Вставить("sColor", ?(Заказ.Проведен, "#4ECDA4", "#F2994A"));
	Результат.Вставить("items", Позиции);
	Результат.Вставить("total", ФорматСуммы(Сумма));
	Возврат Результат;
КонецФункции

Функция СоздатьЗаказ(Устройство, Тело)
	Заказ = Документы.ЗаказПокупателя.СоздатьДокумент();
	Заказ.Дата = ТекущаяДата();
	Заказ.Контрагент = СсылкаКонтрагента(Тело.Получить("customerId"));
	Заказ.Организация = ОрганизацияПоУмолчанию();            // TODO: выверить на боевой базе
	Заказ.ДоговорКонтрагента = ОсновнойДоговор(Заказ.Контрагент); // TODO: выверить
	Заказ.ТипЦен = Устройство.ТипЦен;
	Заказ.СтруктурнаяЕдиница = Устройство.Склад;
	Заказ.Ответственный = Устройство.Менеджер;
	Заказ.СуммаВключаетНДС = Истина;
	Заказ.УчитыватьНДС = Истина;

	ЗаполнитьТовары(Заказ, Тело.Получить("orderItems"));
	Заказ.Записать();
	Возврат Заказ.Ссылка;
КонецФункции

Процедура ОбновитьЗаказ(СсылкаЗаказа, Устройство, Тело)
	Заказ = СсылкаЗаказа.ПолучитьОбъект();
	Если Тело.Получить("customerId") <> Неопределено Тогда
		Заказ.Контрагент = СсылкаКонтрагента(Тело.Получить("customerId"));
	КонецЕсли;
	Если Тело.Получить("orderItems") <> Неопределено Тогда
		ЗаполнитьТовары(Заказ, Тело.Получить("orderItems"));
	КонецЕсли;
	Заказ.Записать();
КонецПроцедуры

Процедура ЗаполнитьТовары(Заказ, ПозицииМассив)
	Заказ.Товары.Очистить();
	Если ТипЗнч(ПозицииМассив) <> Тип("Массив") Тогда Возврат; КонецЕсли;

	Для Каждого Поз Из ПозицииМассив Цикл
		Номенклатура = СсылкаНоменклатуры(ЗначениеИзПозиции(Поз, "productId"));
		Если Номенклатура = Неопределено Тогда Продолжить; КонецЕсли;

		Строка = Заказ.Товары.Добавить();
		Строка.Номенклатура = Номенклатура;
		Строка.Количество = Число(ЗначениеИзПозиции(Поз, "qty"));
		Строка.Цена = Число(ЗначениеИзПозиции(Поз, "price")); // зафиксированная цена с устройства
		Строка.Сумма = Строка.Количество * Строка.Цена;
		Строка.ЕдиницаИзмерения = Номенклатура.БазоваяЕдиницаИзмерения;
		Строка.Коэффициент = 1;
	КонецЦикла;
КонецПроцедуры

Функция НайтиЗаказПоНомеру(Номер)
	Если ПустаяСтрока(Номер) Тогда Возврат Неопределено; КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Документ.ЗаказПокупателя ГДЕ Номер = &Номер УПОРЯДОЧИТЬ ПО Дата УБЫВ");
	Запрос.УстановитьПараметр("Номер", Номер);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
КонецФункции

#КонецОбласти

#Область Вспомогательные

// Идентификатор ссылки в API = строковый GUID (УникальныйИдентификатор).
Функция ИдСсылки(Ссылка)
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда Возврат ""; КонецЕсли;
	Возврат Строка(Ссылка.УникальныйИдентификатор());
КонецФункции

Функция СсылкаКонтрагента(Ид)
	Возврат СсылкаПоИд(Справочники.Контрагенты, Ид);
КонецФункции

Функция СсылкаНоменклатуры(Ид)
	Возврат СсылкаПоИд(Справочники.Номенклатура, Ид);
КонецФункции

Функция СсылкаПоИд(МенеджерСправочника, Ид)
	Если ПустаяСтрока(Ид) Тогда Возврат Неопределено; КонецЕсли;
	Попытка
		Ссылка = МенеджерСправочника.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка(Ид)));
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	Возврат ?(ЗначениеЗаполнено(Ссылка), Ссылка, Неопределено);
КонецФункции

Функция ЗначениеИзПозиции(Поз, Ключ)
	Если ТипЗнч(Поз) = Тип("Соответствие") Тогда
		Возврат Поз.Получить(Ключ);
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

Функция ОрганизацияПоУмолчанию()
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Справочник.Организации ГДЕ НЕ ПометкаУдаления И НЕ ЭтоГруппа");
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Справочники.Организации.ПустаяСсылка());
КонецФункции

Функция ОсновнойДоговор(Контрагент)
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда Возврат Неопределено; КонецЕсли;
	Попытка
		Возврат Контрагент.ОсновнойДоговорВзаиморасчетов;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

Функция НачалоДатыИзСтроки(Строка)
	Дата = ДатаИзISO(Строка);
	Возврат ?(Дата = '00010101', '00010101', НачалоДня(Дата));
КонецФункции

Функция КонецДатыИзСтроки(Строка)
	Дата = ДатаИзISO(Строка);
	Возврат ?(Дата = '00010101', '00010101', КонецДня(Дата));
КонецФункции

Функция ДатаИзISO(Строка)
	Если ПустаяСтрока(Строка) Тогда Возврат '00010101'; КонецЕсли;
	Попытка
		Возврат Дата(Число(Лев(Строка, 4)), Число(Сред(Строка, 6, 2)), Число(Сред(Строка, 9, 2)));
	Исключение
		Возврат '00010101';
	КонецПопытки;
КонецФункции

// "1 078.00 ₴" — пробел разделитель тысяч, точка десятичный (как ждёт фронтенд).
Функция ФорматСуммы(Сумма)
	Возврат Формат(Сумма, "ЧДЦ=2; ЧРД=.; ЧРГ=' '; ЧГ=3") + " ₴";
КонецФункции

#КонецОбласти

#Область HTTP

Функция ПрочитатьТелоJSON(Запрос)
	ТелоСтрока = Запрос.ПолучитьТелоКакСтроку();
	Если ПустаяСтрока(ТелоСтрока) Тогда Возврат Неопределено; КонецЕсли;
	Попытка
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(ТелоСтрока);
		Данные = ПрочитатьJSON(Чтение);
		Чтение.Закрыть();
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	Возврат Данные;
КонецФункции

Функция ОтветJSON(Данные, КодСостояния = 200)
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, Данные);
	ТелоСтрока = Запись.Закрыть();

	Ответ = Новый HTTPСервисОтвет(КодСостояния);
	Ответ.УстановитьТелоИзСтроки(ТелоСтрока, КодировкаТекста.UTF8);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Ответ.Заголовки.Вставить("Access-Control-Allow-Origin", "*");
	Возврат Ответ;
КонецФункции

Функция ОтветНеАвторизован()
	Возврат ОтветJSON(Новый Структура("success, message", Ложь, "Устройство не определено (X-Device-Id)"), 401);
КонецФункции

#КонецОбласти
